# функція обчислення факторіалу (за визначенням)
def factorial(number)
  if 0 == number
    1
  else
    factorial(number - 1) * number
  end
end

# -------------------------------------------------------------------------------------------------------------- #
puts "Шановний користувач, вітаємо вас у застосунку \"Отримання факторіалу натурального числа\"!"

print "\nБудь ласка, введить натуральне число (number >= 0) ->"
number = gets.chomp.to_i # отримали запис числа з клавіатури (без "\n" в кінці) -> перевели його у тип Integer
# перевірка на правильність введення числа
while number < 0 # якщо number не є числом, то повертаеться 0
  print"Неправильне значення! Повторіть введення даних ->"
  number = gets.chomp.to_i
end

print "Відповідь: #{number}! = #{factorial(number)}\n"