# важливо зауважити, що гра буде україномовною, проте будемо передавати аргумент "Stone", "Scissors" чи "Paper"
# (термінал не надає можливість друкувати літери "і", "є" та інші ч/з кодування)
puts("-----------------------------------------------------------")
puts("Вітаємо Вас у грі \"Камінь, ножиці, папір\"!")

# перевіримо, що було передано 2 аргументи (не більше і не менше)
if ARGV.length != 2
  puts("Пробачте, кількість аргументів неправильна!\nКінець гри!")
  exit
end

#надрукували прийняті аргументи (p.s. тобто все ОК)
puts("Було прийнято такі аргументи для гри: #{ARGV}")

# правила гри: перший аргумент - дія гравця; другий аргумент - дія супротивника
argument1 = ARGV[0]
argument2 = ARGV[1]

# важливо зазначити, що аргументи можуть передати і з малої літери (ex: paper),
# тому у перевірці будемо переведити їх у нижній регістр (метод downcase)

# перевіримо коректність аргументів до вимоги гри
# (тобто прийняті аргументи є словами "Stone", "Scissors" чи "Paper")
if (argument1.downcase != "stone" && argument1.downcase != "scissors" && argument1.downcase != "paper") ||
  (argument2.downcase != "stone" && argument2.downcase != "scissors" && argument2.downcase != "paper")
  puts("Помилка: неправильна комбінація аргументів для гри!\nКінець гри!")
  exit
end

# (для розуміння) напишемо, хто і яким чином зробив свій хід
puts("Гравець обрав - #{argument1}")
puts("Супротивник обрав - #{argument2}")

# вирішуємо, хто переміг у грі
if argument1.downcase == argument2.downcase
  puts("Нічия!")
elsif (argument1.downcase == "paper" && argument2.downcase == "stone") ||
  (argument1.downcase == "stone" && argument2.downcase == "scissors") ||
  (argument1.downcase == "scissors" && argument2.downcase == "paper")
  puts("Вітаємо! Переміг гравець!")
else
  puts("На жаль, переміг супротивник...")
end

puts("Дякуємо за участь!\nКінець гри!")
puts("-----------------------------------------------------------")