# функція перевірки числа на простоту (метод пошуку дільників числа)
def is_number_simple(number)
  # оброблюємо особливий випадок для 1
  if number == 1
    return false
  end
  # лінійно перевіряємо число на усі можливі дільники - від 2 до number-1
  i = 2
  while i < number do
    if number % i == 0
      return false
    end
    i += 1
  end
  true
end

# -------------------------------------------------------------------------------------------------------------- #
puts "Шановний користувач, вітаємо вас у застосунку \"Перевірка натурального числа на простоту\"!"

print "\nБудь ласка, введить натуральне число (number > 0) ->"
number = gets.chomp.to_i # отримали запис числа з клавіатури (без "\n" в кінці) -> перевели його у тип Integer
# перевірка на правильність введення числа
while number <= 0 # якщо number не є числом, то повертаеться 0
  print"Неправильне значення! Повторіть введення даних ->"
  number = gets.chomp.to_i
end

print "Число #{number} просте? -> #{is_number_simple(number)}\n"