# реалізуємо функцію, яка перетворює деякий радок в хеш
def word_count(string)
  # перевели усі слова у рядку в нижній решістр і розділили за пробілом
  words = string.downcase.split(" ")
  word_count = Hash.new(0) # створили хеш

  # заповнюємо хеш відповідними значеннями (слово => кількість повторів)
  words.each do |word|
    word_count[word] += 1
  end

  return word_count # повертаємо значення сформованого хеш
end

# ------------------------------------------------------------------------------- #
puts "Шановний користувач, вітаємо вас у застосунку \"Конвертер рядка у хеш\"!"
print "\nБудь ласка, введить деякий рядок латиницею (ex: Hello World) ->"
string = gets.chomp # отримали рядок (без "\n" в кінці)
# отримуємо результат та друкуємо його
hash = word_count(string)
print "\nМаємо такий хеш: #{hash}!"
puts "\nДякую за Вашу працю! До зустрічі!"